Revit 2024 API
BuiltInFailures.StairRampFailures.CannotSplitRailingWithExtensions Property
 Railings with extensions cannot be split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotSplitRailingWithExtensions { get; }
Visual Basic
Public Shared ReadOnly Property CannotSplitRailingWithExtensions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotSplitRailingWithExtensions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace